import { Layout } from "@/components/customer/Layout";
import styles from "./termsOfService.module.scss"

export default function TermsOfService() {
  return (
    <Layout>
      <div className={styles.container}>
        <div className={styles.title}>
          <h1>利用規約</h1>
          <p>この規約（以下「本規約」といいます。）は、SELECT　SHOP　SoLuNa（以下「当社」といいます。）が提供する「CINCLO」（以下「当社サービス」といいます。）の利用に関する条件を定めるものであり、当社サービスを利用するすべてのお客様に適用されます。お客様は、当社サービスを利用する前に、本規約をよくお読みください。</p>
        </div>
        <section>
          <p>第1条（本規約への同意）</p>
          <p>1. お客様は、本規約に従って当社サービスを利用するものとし、本規約に同意しない限り当社サービスを利用できません。当社サービスに関して当社とお客様との間で別途合意した契約及び当社が配布、配信若しくは掲示する文書等（以下、総称して「個別利用規約等」といいます。）に規定する内容は、当該お客様との間で本規約の一部を構成するものとします。</p>
          <p>2. 個別利用規約等において別段の定めのない限り、第４条の規定に従いお客様が本規約に同意したうえで必要情報の入力を完了した時点で、当該お客様と当社との間で、本規約の諸規定に従ったサービス利用契約（以下「本利用契約」といいます。）が成立します。</p>
          <p>第2条（本規約の改訂・変更）</p>
          <p>1. 当社は、当社の判断において、いつでも本規約の内容を変更又は追加できるものとします。変更後の利用規約は、当社が別途定める場合を除いて、当社の運営するウェブサイト（http://cinclo.vercel.app（理由の如何を問わず、当該ウェブサイトのドメイン又は内容が変更された場合は、当該変更後のドメイン等を含みます。）以下「当社ウェブサイト」といいます。）又は当社サービスの利用画面に表示された時点より効力を生じるものとします。</p>
          <p>2. お客様は自己の責任において、随時本規約の最新の内容を確認の上、当社サービスをご利用ください。</p>
          <p>第3条（定義）</p>
          <p>1. 本規約において、次の各号に掲げる用語の意義は、当該各号に定めるところによるものとします。</p>
          <p>（1）「コンテンツ」</p>
          <p>会員が当社サービスを通じてアクセスすることができる情報（文章、画像、動画、音声、音楽その他のサウンド、イメージ、ソフトウェア、プログラム、コードその他のデータを含みますが、これらに限られません。）の総称をいいます。</p>
          <p>（2）「提供コンテンツ」</p>
          <p>当社サービスにおいて当社がお客様に対し提供するコンテンツその他全ての情報をいいます。</p>
          <p>（3）「提携パートナー」</p>
          <p>当社との間で締結する契約その他の合意に基づき、当社サービスと提携するサービス（以下「提携サービス」といいます。）を提供し又はその運営を行う者をいいます。</p>
          <p>第4条（サービス利用）</p>
          <p>1. 当社サービスの利用を希望するお客様は、本規約を遵守することに同意し、当社の定める方法に従い情報を当社に提供することにより、当社サービスを利用することができます。</p>
          <p>2. 当社は、前項に掲げる場合のほか、以下の各号のいずれかの事由に該当する場合には、サービス利用申請を承諾しないことがあります。</p>
          <p>（1）満18歳未満の場合</p>
          <p>（2）未成年者（18歳以上20歳未満の者をいうものとし、以下同様とします。）、成年被後見人、被保佐人又は被補助人のいずれかであって、法定代理人、後見人､保佐人又は補助人の同意等を得ていなかった場合</p>
          <p>（3）サービス利用申請にあたって当社に提供された情報の全部又は一部につき、虚偽、誤り又は記載漏れがあった場合</p>
          <p>（4）申請者が、当社サービスにつき、過去にサービス利用停止措置を受けたことがあり又は現在受けている場合</p>
          <p>（5）過去に、本利用契約その他当社との間で締結した契約上の義務の履行を怠ったことがある場合、その他本利用契約上の義務の履行を怠るおそれがあると当社が判断した場合</p>
          <p>（6）有効な電子メールアドレスを保有していない場合</p>
          <p>（7）第12条第1項第9号に該当すると当社が判断した場合</p>
          <p>（8）その他、当社が申請を適当でないと判断した場合</p>
          <p>第5条（未成年者による利用）</p>
          <p>1. 未成年者は、サービス利用申請を含む当社サービスの利用に関する一切の行為につき、親権者等の法定代理人の同意を得た上でこれを行うものとします。未成年者がサービス利用申請を完了した時点で、当社サービスの利用及び本規約の内容について、法定代理人の同意があったものとみなします。</p>
          <p>2. 未成年者のサービス利用申請者が、法定代理人の同意がないにもかかわらず同意があると偽り又は年齢について成年と偽って当社サービスを利用した場合、その他行為能力者であることを信じさせるために詐術を用いた場合、当該利用に関する一切の法律行為を取り消すことは出来ません。</p>
          <p>3. 本規約の同意時に未成年であったサービス利用者が成年に達した後に当社サービスを利用した場合、当該利用者は、当社サービスに関する一切の法律行為を追認したものとみなされます。</p>
          <p>第6条（個人情報の管理）</p>
          <p>1. 利用は、自己の責任において個人情報を管理・保管するものとし、これを第三者に利用させ、又は貸与、譲渡、名義変更、売買等をしてはならないものとします。当社は、当該情報の一致を確認した場合、当該情報を保有するものとしてサービス利用者が当社サービスを利用したものとみなします。</p>
          <p>2. 個人情報の管理不十分又は第三者の使用等による損害の責任は、サービス利用者が負うものとし、当社は一切の責任を負いません。</p>
          <p>3. サービス利用者は、個人情報が盗用され又は第三者に使用されていることが判明した場合には、直ちにその旨を当社に通知するとともに、当社からの指示に従うものとします。</p>
          <p>第7条（個人情報の取扱い）</p>
          <p>1. サービス利用者は、当社サービスの利用に際して、自己に関する情報その他当社サービスの利用にあたって当社が求める情報（以下「個人情報」といいます。）を送信する場合には、真実かつ正確な情報を提供しなければなりません。</p>
          <p>2. 個人情報に誤りがあった場合又は変更が生じた場合、サービス利用者は、自己の責任において、速やかに個人情報を修正又は変更するものとし、個人情報の内容に虚偽、誤り又は記載漏れがあったことによりサービス利用者に損害が生じたとしても、当社は一切責任を負いません。</p>
          <p>3. 当社は、個人情報から収集する情報を、別途当社が定める情報保護方針に従い、適切に取り扱います。</p>
          <p>第8条（当社サービスの利用）</p>
          <p>1. サービス利用者は、本規約に定める目的の範囲内で、当社の定める方法に従い、当社サービスを利用することができます。</p>
          <p>2. 当社サービスは、サービス利用者が自己のために利用する目的でのみ利用することができ、販売、配布又は開発など、自己利用以外の目的で利用してはなりません。</p>
          <p>3. サービス利用者は、当社サービスを、当社が提供する状態でのみ利用するものとし、当社サービスの複製、修正、変更、改変又は翻案を行ってはなりません。</p>
          <p>4. 当社サービスの提供を受けるために必要な情報端末、ソフトウェア、通信回線その他の通信環境等の準備及び維持は、サービス利用者の費用と責任において行うものとします。</p>
          <p>5. 当社サービスの全部又は一部について、年齢、本人確認の有無、個人情報の有無、その他当社が必要と定める条件を満たしたサービス利用者に限り利用できる場合があり、サービス利用者はあらかじめこれに同意するものとします。</p>
          <p>第9条（提携サービス等の提供）</p>
          <p>1. 当社サービスを通じて、サービス利用者は、提携パートナーの提供する提携サービス（以下「提携サービス等」といいます。）又は当社が提供する当社サービス以外のサービスを利用することができます。当社が提供する他のサービス及び提携サービス等の利用にあたり、サービス利用者は、本規約のほか、当該他のサービスにおいて当社が定め、又は提携サービス等において提携パートナーが定める利用規約その他の条件（当該利用規約等が変更された場合には変更後の条件を含みます。）等に従うものとします。</p>
          <p>2. 提携サービス等については、当該サービスを提供する者が責任を負うものとし、当社は、提携サービス等につき、サービス利用者の特定の目的への適合性、商品的価値、正確性、有用性、完全性、適法性、及びセキュリティ上の欠陥、エラー、バグ又は不具合が存しないこと、並びに第三者の権利を侵害しないことについて、如何なる保証も行うものではありません。</p>
          <p>第10条（禁止行為）</p>
          <p>1. サービス利用者は、当社サービスの利用にあたり、自ら又は第三者をして、以下の各号のいずれかに該当する行為をしてはならず、また、以下の各号の行為を直接又は間接に惹起し、又は容易にしてはなりません。</p>
          <p>（1）当社サービスの誤作動を誘引する行為</p>
          <p>（2）当社サービスが通常意図しないバグを利用する動作又は通常意図しない効果を及ぼす外部ツールの利用、作成又は頒布を行う行為</p>
          <p>（3）当社サービス又は当社サーバー等に過度の負担をかける行為</p>
          <p>（4）法令、裁判所の判決、決定若しくは命令、又は法令上拘束力のある行政措置に違反する行為及びこれらを助長する行為又はそのおそれのある行為</p>
          <p>（5）当社又は他のサービス利用者その他の第三者に対する詐欺又は脅迫行為</p>
          <p>（6）当社又は他のサービス利用者に対し虚偽の事実を申告する行為</p>
          <p>（7）公序良俗に反し又は善良な風俗を害するおそれのある行為</p>
          <p>（8）当社又は他のサービス利用者その他の第三者の知的財産権、肖像権、プライバシー、名誉、その他の権利若しくは利益を侵害する行為又はそのおそれのある行為</p>
          <p>（9）当社サービスを通じ、以下に該当し又は該当すると当社が判断した情報を当社サービス上に送信又は投稿する行為</p>

          <p>自殺、自傷行為を誘引、勧誘若しくは助長する表現、わいせつな表現、又は薬物・危険ドラッグの売買に関する情報若しくはこれらの不適切な利用を助長する表現</p>
          <p>当社サービス以外のサービス、宗教的行為、宗教団体、政治的活動、政治団体の宣伝、広告</p>
          <p>チェーンメール、無限連鎖講、リードメール、又は違法な勧誘、宣伝等</p>
          <p>未成年者に悪影響を及ぼすおそれのある情報</p>
          <p>残虐な表現、性的な表現その他、他人に不快感を与えるおそれのある情報</p>
          <p>ワンクリック詐欺サイト、アダルトサイト、コンピュータウィルス等の有害なプログラムを流布させる情報及びこれらの情報のリンク</p>
          <p>上記に類する情報その他当社が不適切と判断する情報</p>
          <p>（10）当社サービスを逆アセンブル、逆コンパイル、リバースエンジニアリング、その他当社サービスのソースコードを解析する行為</p>
          <p>（11）当社サービスに接続されたシステムに権限なく不正にアクセスし又は当社設備に蓄積された情報を不正に書き換え若しくは消去する行為</p>
          <p>（12）当社サービスを複製、譲渡、貸与又は改変する行為</p>
          <p>（13）故意に虚偽のデータ等を公開し又は投稿する行為</p>
          <p>（14）他のサービス利用者の情報の収集を目的とする行為</p>
          <p>（15）当社又は他のサービス利用者その他の第三者に成りすます行為</p>
          <p>（16）他のサービス利用者の個人情報を利用する行為</p>
          <p>（17）当社が事前に許諾しない当社サービス上での宣伝、広告、勧誘、又は営業行為</p>
          <p>（18）反社会的勢力等への利益供与行為及びこれにつながる可能性のある行為</p>
          <p>（19）本規約及び当社サービスの趣旨・目的に反する行為</p>
          <p>（20）その他、当社が不適切と判断する行為</p>
          <p>第11条（規約違反の場合の措置等）</p>
          <p>1. 当社は、サービス利用者が次の各号のいずれかに該当し又は該当するおそれがあると当社が判断した場合には、当社の裁量により、何らの通知も行うことなく、当該サービス利用者に対し、情報の全部若しくは一部の削除、当社サービスの利用の一時停止若しくは制限、個人情報の削除又は利用契約の解除等の措置（以下「利用停止等」といいます。）を講じることができるものとします。</p>
          <p>（1）本規約のいずれかの条項に違反した場合</p>
          <p>（2）当社に提供された情報の全部又は一部につき虚偽の事実があることが判明した場合</p>
          <p>（3）死亡し又は後見開始、保佐開始若しくは補助開始の審判を受けた場合</p>
          <p>（4）18歳未満であることが判明した場合</p>
          <p>（5）18歳以上20歳未満の未成年者、成年後見人、被保佐人又は被補助人のいずれかであって、法定代理人、後見人、保佐人又は補助人の同意等を得ていないことが判明した場合</p>
          <p>（6）支払停止若しくは支払不能となり、又は破産手続開始、民事再生手続開始若しくはこれらに類する手続の開始の申立てがあった場合</p>
          <p>（7）当社からの問い合わせその他の回答を求める連絡に対して14日又は別途当社が指定した期間を超えて応答がない場合</p>
          <p>（8）当社サービスの利用に際して、過去に利用停止等の措置を受けたことがあり又は現在受けている場合</p>
          <p>（9）反社会的勢力等であるか、又は資金提供その他を通じて反社会的勢力等の維持、運営若しくは経営に協力若しくは関与する等、反社会的勢力等との何らかの交流若しくは関与を行っていると当社が判断した場合</p>
          <p>（10）当社サービスの運営、保守管理上必要であると当社が判断した場合</p>
          <p>（11）その他前各号に類する事由があると当社が判断した場合</p>
          <p>2. サービス利用者は、利用停止等の後も、当社及び第三者に対する本利用契約上の一切の義務及び債務（損害賠償債務を含みますが、これに限りません。）を免れるものではありません。</p>
          <p>3. 当社は、本条に基づき当社が行った行為によりサービス利用者に生じた損害について一切の責任を負わず、個人情報削除後も、サービス利用者に関し当社が取得した情報を保有・利用することができるものとします。</p>
          <p>4. 当社は、サービス利用者が第1項各号に該当し又は該当するおそれがあると当社が判断した場合その他当社が必要と認める場合には、サービス利用者に対し、違反行為の中止、サービス利用者が送信又は投稿した情報の自発的な削除・訂正等を求めることがあり、サービス利用者は、当社が定める期間内に当該求めに応じるものとします。</p>
          <p>5. 当社は、本条に基づき当社が行った措置によりサービス利用者に生じた不利益や損害について一切の責任を負いません。</p>
          <p>第12条（違法投稿等の通報）</p>
          <p>1. サービス利用者は、他のサービス利用者の情報開示を行う等、自己又は第三者の権利を侵害している場合その他本規約に違反するおそれがあると判断した場合には、当社所定の方法に従い、当社に通報することができるものとします。</p>
          <p>2. 当社は、前項の定めに基づく通報を受けた場合、当社の裁量に基づき、当該通報の内容が事実であるかの確認を行い、通報の対象となったサービス利用者に対して、何らの通知も行うことなく、利用停止等の措置を講じることができるものとします。</p>
          <p>3. 前二項の定めは、サービス利用者に対し、当社に対する通報を行う義務を負わせるものではなく、また当社に対し、サービス利用者からの通報に応対する義務を負わせるものでもありません。</p>
          <p>第13条（当社サービスの変更・中断・終了等）</p>
          <p>1. 当社は、サービス利用者に事前に通知することなく、当社サービスの内容の全部又は一部を変更又は追加することができるものとします。</p>
          <p>2. 当社は、事前に、当社サービス上又は当社ウェブサイト上への掲示その他当社が適当と判断する方法でサービス利用者に通知することにより、当社の裁量で、当社サービスを終了することができるものとします。ただし、緊急の場合はサービス利用者への通知を行わない場合があります。</p>
          <p>3. 当社は、以下各号の事由が生じた場合には、サービス利用者に事前に通知することなく、当社サービスの一部又は全部を一時的に中断することができるものとします。</p>
          <p>（1）当社サービス用の通信機器設備等に関わるメンテナンスや修理を定期的又は緊急に行う場合</p>
          <p>（2）アクセス過多、その他予期せぬ要因でシステムに負荷が集中した場合</p>
          <p>（3）サービス利用者のセキュリティを確保する必要が生じた場合</p>
          <p>（4）電気通信事業者の役務が提供されない場合</p>
          <p>（5）天災等の不可抗力により当社サービスの提供が困難な場合</p>
          <p>（6）火災、停電、その他の不慮の事故又は戦争、紛争、動乱、暴動、労働争議等により当社サービスの提供が困難な場合</p>
          <p>（7）法令又はこれらに基づく措置により当社サービスの運営が不能となった場合</p>
          <p>（8）その他前各号に準じ当社が必要と判断した場合</p>
          <p>4. 当社は、本条に基づき当社が行った措置によりサービス利用者に生じた損害について一切の責任を負いません。</p>
          <p>第14条（損害賠償）</p>
          <p>1. サービス利用者による本規約違反行為その他当社サービスの利用に起因して、当社に直接又は間接の損害が生じた場合（当該行為が原因で、当社が第三者から損害賠償請求その他の請求を受けた場合を含みます。）、サービス利用者は、当社に対し、その全ての損害（弁護士等専門家費用及び当社において対応に要した人件費相当額を含みます。）を賠償しなければなりません。</p>
          <p>2. 当社は、当社サービスの利用に関連してサービス利用者が被った損害につき、一切の責任を負いません。ただし、当社に故意又は重大な過失がある場合、当社は、サービス利用者に現実に発生した直接かつ通常の損害に限り、これを賠償するものとします。</p>
          <p>第15条（秘密保持）</p>
          <p>1. サービス利用者は、当社の事前の書面による承諾がある場合を除き、当社サービスに関連して当社が秘密である旨指定して開示した非公知の情報を秘密に取り扱うものとします。</p>
          <p>2. サービス利用者は、当社から求められた場合はいつでも、当社の指示に従い、遅滞なく、前項の情報及び当該情報を記載又は記録した書面その他の記録媒体物並びにその全ての複製物等を返却又は廃棄しなければなりません。</p>
          <p>第16条（権利の帰属）</p>
          <p>1. 当社サービス及び提供コンテンツに関する一切の知的財産権は、当社又は当社にライセンスを許諾している者に帰属するものとします。</p>
          <p>2. 当社は、サービス利用者に対し、当社サービス及び提供コンテンツにつき、当社サービスの利用に必要な範囲における非独占的な利用を許諾します。ただし、かかる利用許諾は、第三者に対し再使用許諾する権利を含むものではなく、また、サービス利用者に対し、提供コンテンツについての知的財産権、所有権類似の権利又は自由に処分しうる権利その他の権利の譲渡又は付与を意味するものではありません。</p>
          <p>3. 当社サービス上、当社の商標、ロゴ及びサービスマーク等（以下、総称して「商標等」といいます。）が表示される場合がありますが、当社は、サービス利用者その他の第三者に対し、商標等を譲渡し、又はその使用を許諾するものではありません。</p>
          <p>第17条（保証の否認及び免責）</p>
          <p>1. 当社は、当社サービス及び当社サービスを通じて提供されるコンテンツその他一切の情報につき、サービス利用者の特定の目的への適合性、商品的価値、正確性、有用性、完全性、適法性を有すること、及びセキュリティ上の欠陥、エラー、バグ又は不具合が存しないこと、並びに第三者の権利を侵害しないことについて、如何なる保証も行うものではありません。</p>
          <p>2. 当社は、当社サービスが全ての情報端末に対応していることを保証するものではなく、当社サービスの利用に供する情報端末のＯＳのバージョンアップ等に伴い、当社サービスの動作に不具合が生じる可能性があることにつき、サービス利用者はあらかじめ了承するものとします。当社は、かかる不具合が生じた場合に当社が行うプログラムの修正等により、当該不具合が解消されることを保証するものではありません。</p>
          <p>3. 当社は、サービス利用者間で行われる連絡その他一切の交渉につき関与しません。万一、サービス利用者間で紛争や問題が生じた場合、サービス利用者は、直ちにその旨を当社に通知するとともに、自己の責任と費用においてこれを解決するものとし、当社はこれに一切関与せず、何ら責任を負わないものとします。</p>
          <p>4. 前項のほか、当社サービスに関し、サービス利用者と第三者との間で紛争が生じた場合、サービス利用者は、直ちにその旨を当社に通知するとともに、自己の責任と費用においてこれを解決するものとし、当社はこれに一切関与せず、何ら責任を負わないものとします。</p>
          <p>第18条（連絡方法）</p>
          <p>1. 当社サービスに関する当社からサービス利用者への連絡（本規約の変更又は追加に関する通知を含みますが、これらに限りません。）は、当社ウェブサイト内の適宜の場所への掲示、電子メールの送信、又はプッシュ通知その他当社が適当と判断する方法により行うものとします。</p>
          <p>2. 当社が電子メールの送信による通知を行った場合、当社からの通知は、サービス利用者が登録したメールアドレスにメールを送信することをもって、当該メールが通常到達すべきときに到達したものとみなします。</p>
          <p>3. 当社サービスに関する問い合わせその他サービス利用者から当社に対する連絡又は通知は、当社ウェブサイト内の適宜の場所に設置するお問い合わせフォームへの送信その他当社が指定する方法により行うものとします。</p>
          <p>4. 当社は、サービス利用者の同意を得たうえで、サービス利用者が登録したメールアドレスその他の個人情報に基づき、当社サービスに関する広告・宣伝等の連絡を行うことがあります。</p>
          <p>第19条（権利義務の譲渡禁止）</p>
          <p>1. サービス利用者は、当社の書面による事前の承諾がある場合を除き、本利用契約に基づくサービス利用者の権利若しくは義務、又は本利用契約上の地位について、第三者への譲渡、承継、担保設定、その他一切の処分をすることはできません。</p>
          <p>2. 当社が、当社サービスにかかる事業を第三者に譲渡し、又は当社が消滅会社若しくは分割会社となる合併若しくは会社分割等により当社サービスに係る事業を包括承継させたときは、当社は、当該事業譲渡等に伴い、当社サービスに関する利用契約上の地位、権利及び義務並びに個人情報その他のサービス利用者に関する情報を当該事業譲渡等の譲受人又は承継人に譲渡することができるものとし、サービス利用者は、予めこれに同意するものとします。</p>
          <p>第20条（分離可能性）</p>
          <p>1. 本規約のいずれかの条項又はその一部が、消費者契約法その他の法令等により無効又は執行不能と判断された場合であっても、当該無効又は執行不能と判断された条項又は部分（以下「無効等部分」といいます。）以外の部分は、継続して完全に効力を有するものとします。当社及びサービス利用者は、無効等部分を、適法とし、執行力をもたせるために必要な範囲で修正し、無効等部分の趣旨及び法律的・経済的に同等の効果を確保できるように努めるものとします。 本規約のいずれかの条項又はその一部が、あるサービス利用者との関係で無効又は執行不能と判断された場合であっても、他のサービス利用者との関係における有効性等には影響を及ぼさないものとします。</p>
          <p>2. 本規約のいずれかの条項又はその一部が、あるサービス利用者との関係で無効又は執行不能と判断された場合であっても、他のサービス利用者との関係における有効性等には影響を及ぼさないものとします。</p>
          <p>第21条（準拠法、管轄裁判所）</p>
          <p>1. 本規約は日本法に準拠するものとし、本規約に起因し又は関連する一切の紛争については、訴額に応じ、東京簡易裁判所又は東京地方裁判所を第一審の専属的合意管轄裁判所とします。</p>          
        </section>
      </div>
    </Layout>
  )
}