import { Layout } from "@/components/customer/Layout";
import styles from "./privacyPolicy.module.scss"

export default function PrivacyPolicy() {
  return (
    <Layout>
      <div className={styles.container}>
        <div className={styles.title}>
          <h1>プライバシーポリシー</h1>
          <p>SELECT SHOP SOLuNaでは、個人情報の保護に関する法律に基づき、当社の保有する個人情報に関し、次のとおり公表します。</p>
        </div>
        <section>
          <p>個人情報の取得</p>
          <p>当社は、個人情報を取得する際は、お客様及び従業者に対し利用目的を明確にし、その目的達成に必要な限度において適法かつ公正な手段を用います。ただし、緊急のための連絡先をご本人様以外から取得する場合があります。</p>
        </section>
        <section>
          <p>個人情報の利用目的</p>
          <p>当社は、以下の利用目的に従い、取得した個人情報を利用します。あらかじめ明示した利用目的の範囲を超えて、個人情報を利用する必要が生じた場合は、その旨をご連絡し、ご本人の同意をいただいた上で、利用いたします。</p>
          <p>1）お客様と当社との間の契約の成立および履行（当社のサービスにおける本人確認、商品の発送、請求、決済及び関連するアフターサービス等でお客様の個人情報を利用いたします。）</p>
          <p>2）お客様との商談、打合せのための連絡</p>
          <p>3）各種イベントの運営</p>
          <p>4）当社、関連会社および当社の業務提携先のサービス・商品等のご案内（宣伝物、印刷物の送付等）</p>
          <p>5）マーケティングおよび販売促進、商品企画のための統計データ作成（個人は識別できない形でお客様の年齢、住所、職業等の情報と当社サービスの商品の利用傾向等を分析し、商品ラインナップの拡充等を行います。 ）</p>
          <p>6）当社におけるサービスの開発、分析及び研究（サービスの開発、分析及び研究のために、お客様の個人情報（属性情報やサービス利用履歴等）を分析する場合があります。）</p>
          <p>7）当社事業（ファッションレンタル事業）における提案、募集及び契約</p>
          <p>8）当社事業（ファッションレンタル事業）における当社のサービスの停止・中止・契約解除その他当社のサービスに関する連絡</p>
          <p>9）緊急時における連絡</p>
          <p>10）業務提携先その他の第三者に対する提供</p>
          <p>11）雇用、労務・人事管理業務に関連する事項</p>
          <p>12) 当社の利用規約、個人情報保護方針又はプライバシーポリシーの変更等の連絡</p>
          <p>13）その他上記に付帯関連する事項（以上、当社の開示対象個人情報の利用目的となります。）</p>
        </section>
        <section>
          <p>電話による個人情報録音について</p>
          <p>当社では、お客様のご意見やご要望等を正確に把握して対応するため通話内容を録音させていただく場合がございます。予めご了承ください。これら録音された個人情報は、利用の必要がなくなり次第速やかに消去いたします。</p>
        </section>
        <section>
          <p>監視カメラによる個人情報録画について</p>
          <p>当社が管理する施設において、お客様の安全のため、防犯のために監視カメラにて録画をさせていただく場合がございます。予めご了承下さい。録画された個人情報は、一定期間保管され、その後速やかに消去いたします。</p>
        </section>
        <section>
          <p>個人情報の第三者提供について</p>
          <p>当社は、取得した個人情報を適切に管理し、ご本人の同意を得ることなく第三者への提供を行うことはありません。ただし、次の場合は除きます。</p>
          <p>法令に基づく場合</p>
          <p>人の生命、身体又は財産の保護のために必要がある場合であって、本人の同意を得ることが困難であるとき</p>
          <p>公衆衛生の向上又は児童の健全な育成の推進のために特に必要がある場合であって、本人の同意を得ることが困難であるとき</p>
          <p>国の機関若しくは地方公共団体又はその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、本人の同意を得ることによって当該事務の遂行に支障を及ぼすおそれがあるとき</p>
        </section>
        <section>
          <p>第三者配信事業者の広告配信について</p>
          <p>当社は、第三者（Google、Yahoo! JAPAN等）が提供する広告配信サービスを利用しており、当該第三者はクッキー等の識別情報を使用して、当社ウェブサイトへの訪問・行動履歴情報を取得、利用している場合があります。当該第三者が、これらの情報を広告配信以外の目的で利用することはありません。</p>
        </section>
        <section>
          <p>{"<Google によって提供されるディスプレイ広告に関連するサービスの利用について>"}</p>
          <p>Google によるクッキーの使用を無効にする場合は、Google 広告のオプトアウトページにアクセスして、Googleによるクッキーの使用を無効にすることができます。</p>
        </section>
        <section>
          <p>{"<Yahoo! JAPANによって提供されるサイトリターゲティング広告の利用について>"}</p>
          <p>Yahoo! JAPANがクッキーを通じて取得する情報の利用についてはこちらを御参照下さい。Yahoo! JAPANによるクッキーの使用を無効にする場合は、Yahoo! JAPANの配信するサイトリターゲティング広告のオプトアウトページにアクセスして、Yahoo! JAPANによるクッキーの使用を無効にすることができます。</p>
        </section>
        <section>
          <p>当ウェブサイトに対する訪問情報について</p>
          <p>当ウェブサイトでは、皆様のIPアドレスおよびクッキーというデータファイルを利用して皆様の訪問回数、訪問いただいたページなどの情報を収集しております。これは、当ウェブサイトのご利用を便利にするため内容を充実させる際の統計資料としてのみ使用するものであり、お問合わせサービスをご利用の際にご登録いただかない限り個人を特定できる情報を得ることはありません。</p>
          <p>IPアドレス:インターネットなどのネットワークに接続されたコンピューター毎に割り振られる番号</p>
          <p>クッキー:ウェブサイトが訪問者のコンピューターに書き込み、その間の情報のやりとりに使用されるデータファイル</p>
        </section>
        <section>
          <p>クレジットカード情報の取り扱いについて</p>
          <p>【クレジットカード情報の取扱について】</p>
          <p>お客様のクレジットカード情報について、以下の通り利用いたします。</p>
          <p>a. クレジットカード情報の利用目的</p>
          <p>当社サービスのご利用にクレジットカード決済を希望するお客様のサービス代金決済処理のため、および同決済に関するお問い合わせに対応するため</p>
          <p>b. 取得者名</p>
          <p>SELECT SHOP SOLuNa</p>
          <p>c. 提供先名</p>
          <p>株式会社（以下「決済代行会社」といいます）</p>
          <p>また、クレジットカード情報を決済代行会社に提供することについて以下の項目を明示いたします。</p>
          <p>a. 決済代行会社に提供する目的</p>
          <p>当社サービスのご利用にクレジットカード決済を希望するお客様のサービス代金決済処理のため、および同決済に関するお問い合わせに対応するため</p>
          <p>b. 決済代行会社に提供する個人情報の項目</p>
          <p>クレジットカード番号、有効期限、セキュリティコード（CVV）</p>
          <p>c. クレジットカード情報提供の手段または方法</p>
          <p>WebサイトからのSSL通信による伝送</p>
          <p>d. クレジットカード情報の提供を受ける者または提供を受ける者の組織の種類および属性</p>
          <p>クレジットカード決済代行会社</p>
          <p>e. 当社と決済代行会社との間の個人情報の取り扱いに関する契約</p>
          <p>有り</p>
        </section>
        <section>
          <p>【2023年4月3日 施行】</p>
        </section>

      </div>
    </Layout>
  )
}